Тупой способ, т.к видно ключи

provider "aws" {
    access_key = "12345"
    secret_key = "12345"
    region     = "blablabla"
}
#=================================================================================# 

Это когда залогинен или экспортнул данные

provider "aws" {}

#=================================================================================# 

Использование переменных(сами переменные в файле variables.tf)

provider "aws" {
  region = var.region
}

#=================================================================================# 
